quad_riblet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../constants.dat"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    leftWall
    {
        type fixedValue;
        value uniform ($u_max 0 0);
    }


    rightWall
    {
      type inletOutlet;
      inletValue uniform (0 0 0);
      value uniform (0 0 0);
    }


    lowerWall
    {
        type            noSlip;
    }


    atmosphere
    {

        type slip;
    }


    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
